[
    {
        "title": "Shrimp and Zucchini Rice Bowl",
        "picture": "https://images.media-allrecipes.com/userphotos/560x315/7865474.jpg",
        "ingredients": [
            "2 tablespoons olive oil, divided",
            "2 cups sliced green onions",
            "1/4 teaspoon salt, divided",
            "2 (8.8 ounce) packages UNCLE BEN'S® READY RICE® Whole Grain Brown Rice",
            "2 1/2 cups sliced zucchini",
            "3 cloves garlic, minced",
            "1 pound peeled and deveined large shrimp",
            "1/2 cup unsalted chicken stock",
            "1 tablespoon fresh lemon juice",
            "1 teaspoon Dijon mustard",
            "1 tablespoon unsalted butter",
            "1 tablespoon chopped fresh tarragon",
            "2 ounces goat cheese, crumbled",
            "Tarragon leaves for garnish (optional)"
        ],
        "method": [
            "Heat 1 tablespoon oil in a large skillet over medium-low heat. Add green onions and 1/8 teaspoon salt. Cover and cook until green onions are tender, stirring occasionally, about 3 minutes; add a tablespoon of water during cooking if green onions start to brown. Add rice to skillet; cook over medium heat 2 minutes or until thoroughly heated, stirring occasionally. Divide rice mixture evenly among 4 bowls.",
            "Increase heat to medium-high and add remaining 1 tablespoon oil to skillet. Add zucchini and remaining 1/8 teaspoon salt; saute 3 minutes or until zucchini starts to soften. Add garlic and shrimp; cook 4 minutes or until shrimp are done. Divide mixture evenly among bowls.",
            "Add chicken stock, lemon juice, and mustard to skillet, scraping pan to loosen browned bits; cook 3 minutes or until sauce slightly thickens. Remove from heat, and stir in butter and tarragon. Drizzle sauce evenly over bowls. Sprinkle with goat cheese. Garnish with additional tarragon, if desired.",
            ""
        ]
    },
    {
        "title": "World's Best Lasagna",
        "picture": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https://images.media-allrecipes.com/userphotos/3910164.jpg&w=800&q=85",
        "ingredients": [
            "1 pound sweet Italian sausage",
            "¾ pound lean ground beef",
            "½ cup minced onion",
            "2 cloves garlic, crushed",
            "1 (28 ounce) can crushed tomatoes",
            "2 (6 ounce) cans tomato paste",
            "2 (6.5 ounce) cans canned tomato sauce",
            "½ cup water",
            "2 tablespoons white sugar",
            "1 ½ teaspoons dried basil leaves",
            "½ teaspoon fennel seeds",
            "1 teaspoon Italian seasoning",
            "1 ½ teaspoons salt, divided, or to taste",
            "¼ teaspoon ground black pepper",
            "4 tablespoons chopped fresh parsley",
            "12  lasagna noodles",
            "16 ounces ricotta cheese",
            "1  egg",
            "¾ pound mozzarella cheese, sliced",
            "¾ cup grated Parmesan cheese"
        ],
        "method": [
            "In a Dutch oven, cook sausage, ground beef, onion, and garlic over medium heat until well browned. Stir in crushed tomatoes, tomato paste, tomato sauce, and water. Season with sugar, basil, fennel seeds, Italian seasoning, 1 teaspoon salt, pepper, and 2 tablespoons parsley. Simmer, covered, for about 1 1/2 hours, stirring occasionally.",
            "Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes. Drain noodles, and rinse with cold water.  In a mixing bowl, combine ricotta cheese with egg, remaining parsley, and 1/2 teaspoon salt.",
            "Preheat oven to 375  degrees F (190 degrees C).",
            "To assemble, spread 1 1/2 cups of meat sauce in the bottom of a 9x13 inch baking dish.  Arrange 6 noodles lengthwise over meat sauce. Spread with one half of the ricotta cheese mixture. Top with a third of mozzarella cheese slices. Spoon 1 1/2 cups meat sauce over mozzarella, and sprinkle with 1/4 cup Parmesan cheese.  Repeat layers, and top with remaining mozzarella and Parmesan cheese. Cover with foil: to prevent sticking, either spray foil with cooking spray, or make sure the foil does not touch the cheese.",
            "Bake in preheated oven for 25 minutes. Remove foil, and bake an additional 25 minutes. Cool for 15 minutes before serving."
        ]
    },
    {
        "title": "Best Chocolate Chip Cookies",
        "picture": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https://images.media-allrecipes.com/userphotos/3910164.jpg&w=800&q=85",
        "ingredients": [
            "1 cup butter, softened",
            "1 cup white sugar",
            "1 cup packed brown sugar",
            "2  eggs",
            "2 teaspoons vanilla extract",
            "1 teaspoon baking soda",
            "2 teaspoons hot water",
            "½ teaspoon salt",
            "3 cups all-purpose flour",
            "2 cups semisweet chocolate chips",
            "1 cup chopped walnuts"
        ],
        "method": [
            "Preheat oven to 350 degrees F (175 degrees C).",
            "Cream together the butter, white sugar, and brown sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Dissolve baking soda in hot water.  Add to batter along with salt. Stir in flour, chocolate chips, and nuts. Drop by large spoonfuls onto ungreased pans.",
            "Bake for about 10 minutes in the preheated oven, or until edges are nicely browned."
        ]
    },
    {
        "title": "Fluffy Pancakes",
        "picture": "https://images.media-allrecipes.com/userphotos/560x315/5079227.jpg",
        "ingredients": [
            "3/4 cup milk",
            "2 tablespoons white vinegar",
            "1 cup all-purpose flour",
            "2 tablespoons white sugar",
            "1 teaspoon baking powder",
            "1/2 teaspoon baking soda",
            "1/2 teaspoon salt",
            "1 egg",
            "2 tablespoons butter, melted",
            "cooking spray"
        ],
        "method": [
            "Combine milk with vinegar in a medium bowl and set aside for 5 minutes to \"sour\".",
            "Combine flour, sugar, baking powder, baking soda, and salt in a large mixing bowl. Whisk egg and butter into \"soured\" milk. Pour the flour mixture into the wet ingredients and whisk until lumps are gone.",
            "Heat a large skillet over medium heat, and coat with cooking spray. Pour 1/4 cupfuls of batter onto the skillet, and cook until bubbles appear on the surface. Flip with a spatula, and cook until browned on the other side.",
            ""
        ]
    },
    {
        "title": "Good Old Fashioned Pancakes",
        "picture": "https://images.media-allrecipes.com/userphotos/560x315/4948036.jpg",
        "ingredients": [
            "1 1/2 cups all-purpose flour",
            "3 1/2 teaspoons baking powder",
            "1 teaspoon salt",
            "1 tablespoon white sugar",
            "1 1/4 cups milk",
            "1 egg",
            "3 tablespoons butter, melted"
        ],
        "method": [
            "In a large bowl, sift together the flour, baking powder, salt and sugar. Make a well in the center and pour in the milk, egg and melted butter; mix until smooth.",
            "Heat a lightly oiled griddle or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake. Brown on both sides and serve hot.",
            ""
        ]
    },
    {
        "title": "Banana Banana Bread",
        "picture": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https://images.media-allrecipes.com/userphotos/3910164.jpg&w=800&q=85",
        "ingredients": [
            "2 cups all-purpose flour",
            "1 teaspoon baking soda",
            "¼ teaspoon salt",
            "½ cup butter",
            "¾ cup brown sugar",
            "2  eggs, beaten",
            "2 ⅓ cups mashed overripe bananas"
        ],
        "method": [
            "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5 inch loaf pan.",
            "In a large bowl, combine flour, baking soda and salt. In a separate bowl, cream together butter and brown sugar. Stir in eggs and mashed bananas until well blended. Stir banana mixture into flour mixture; stir just to moisten. Pour batter into prepared loaf pan.",
            "Bake in preheated oven for 60 to 65 minutes, until a toothpick inserted into center of the loaf comes out clean. Let bread cool in pan for 10 minutes, then turn out onto a wire rack."
        ]
    },
    {
        "title": "Apple Pie by Grandma Ople",
        "picture": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https://images.media-allrecipes.com/userphotos/3910164.jpg&w=800&q=85",
        "ingredients": [
            "1 recipe pastry for a 9 inch double crust pie",
            "½ cup unsalted butter",
            "3 tablespoons all-purpose flour",
            "¼ cup water",
            "½ cup white sugar",
            "½ cup packed brown sugar",
            "8  Granny Smith apples - peeled, cored and sliced"
        ],
        "method": [
            "Preheat oven to 425 degrees F (220 degrees C). Melt the butter in a saucepan. Stir in flour to form a paste. Add water, white sugar and brown sugar, and bring to a boil. Reduce temperature and let simmer.",
            "Place the bottom crust in your pan. Fill with apples, mounded slightly. Cover with a lattice work crust.  Gently pour the sugar and butter liquid over the crust.  Pour slowly so that it does not run off.",
            "Bake 15 minutes in the preheated oven. Reduce the temperature to 350 degrees F (175 degrees C). Continue baking for 35 to 45 minutes, until apples are soft."
        ]
    },
    {
        "title": "Delicious Ham and Potato Soup",
        "picture": "https://images.media-allrecipes.com/userphotos/560x315/8106914.jpg",
        "ingredients": [
            "3 1/2 cups peeled and diced potatoes",
            "1/3 cup diced celery",
            "1/3 cup finely chopped onion",
            "3/4 cup diced cooked ham",
            "3 1/4 cups water",
            "2 tablespoons chicken bouillon granules",
            "1/2 teaspoon salt, or to taste",
            "1 teaspoon ground white or black pepper, or to taste",
            "5 tablespoons butter",
            "5 tablespoons all-purpose flour",
            "2 cups milk"
        ],
        "method": [
            "Combine the potatoes, celery, onion, ham and water in a stockpot. Bring to a boil, then cook over medium heat until potatoes are tender, about 10 to 15 minutes. Stir in the chicken bouillon, salt and pepper.",
            "In a separate saucepan, melt butter over medium-low heat. Whisk in flour with a fork, and cook, stirring constantly until thick, about 1 minute. Slowly stir in milk as not to allow lumps to form until all of the milk has been added. Continue stirring over medium-low heat until thick, 4 to 5 minutes.",
            "Stir the milk mixture into the stockpot, and cook soup until heated through. Serve immediately.",
            ""
        ]
    },
    {
        "title": "Banana Crumb Muffins",
        "picture": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https://images.media-allrecipes.com/userphotos/3910164.jpg&w=800&q=85",
        "ingredients": [
            "1 ½ cups all-purpose flour",
            "1 teaspoon baking soda",
            "1 teaspoon baking powder",
            "½ teaspoon salt",
            "3  bananas, mashed",
            "¾ cup white sugar",
            "1  egg, lightly beaten",
            "⅓ cup butter, melted",
            "⅓ cup packed brown sugar",
            "2 tablespoons all-purpose flour",
            "⅛ teaspoon ground cinnamon",
            "1 tablespoon butter"
        ],
        "method": [
            "Preheat oven to 375 degrees F (190 degrees C). Lightly grease 10 muffin cups, or line with muffin papers.",
            "In a large bowl, mix together 1 1/2 cups flour, baking soda, baking powder and salt. In another bowl, beat together bananas, sugar, egg and melted butter. Stir the banana mixture into the flour mixture just until moistened. Spoon batter into prepared muffin cups.",
            "In a small bowl, mix together brown sugar, 2 tablespoons flour and cinnamon. Cut in 1 tablespoon butter until mixture resembles coarse cornmeal. Sprinkle topping over muffins.",
            "Bake in preheated oven for 18 to 20 minutes, until a toothpick inserted into center of a muffin comes out clean."
        ]
    },
    {
        "title": "To Die For Blueberry Muffins",
        "picture": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https://images.media-allrecipes.com/userphotos/3910164.jpg&w=800&q=85",
        "ingredients": [
            "1 ½ cups all-purpose flour",
            "¾ cup white sugar",
            "½ teaspoon salt",
            "2 teaspoons baking powder",
            "⅓ cup vegetable oil",
            "1  egg",
            "⅓ cup milk, or more as needed",
            "1 cup fresh blueberries",
            "½ cup white sugar",
            "⅓ cup all-purpose flour",
            "¼ cup butter, cubed",
            "1 ½ teaspoons ground cinnamon"
        ],
        "method": [
            "Preheat oven to 400 degrees F (200 degrees C). Grease muffin cups or line with muffin liners.",
            "Combine 1 1/2 cups flour, 3/4 cup sugar, salt and baking powder. Place vegetable oil into a 1 cup measuring cup; add the egg and add enough milk to reach the 1-cup mark. Mix this with flour mixture. Fold in blueberries. Fill muffin cups right to the top, and sprinkle with crumb topping mixture.",
            "To Make Crumb Topping: Mix together 1/2 cup sugar, 1/3 cup flour, 1/4 cup butter,  and 1 1/2 teaspoons cinnamon. Mix with fork, and sprinkle over muffins before baking.",
            "Bake for 20 to 25 minutes in the preheated oven, or until done."
        ]
    },
    {
        "title": "Best Brownies",
        "picture": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https://images.media-allrecipes.com/userphotos/3910164.jpg&w=800&q=85",
        "ingredients": [
            "½ cup butter",
            "1 cup white sugar",
            "2  eggs",
            "1 teaspoon vanilla extract",
            "⅓ cup unsweetened cocoa powder",
            "½ cup all-purpose flour",
            "¼ teaspoon salt",
            "¼ teaspoon baking powder",
            "3 tablespoons butter, softened",
            "3 tablespoons unsweetened cocoa powder",
            "1 tablespoon honey",
            "1 teaspoon vanilla extract",
            "1 cup confectioners' sugar"
        ],
        "method": [
            "Preheat oven to 350 degrees F (175 degrees C). Grease and flour an 8-inch square pan.",
            "In a large saucepan, melt 1/2 cup butter. Remove from heat, and stir in sugar, eggs, and 1 teaspoon vanilla. Beat in 1/3 cup cocoa, 1/2 cup flour, salt, and baking powder. Spread batter into prepared pan.",
            "Bake in preheated oven for 25 to 30 minutes. Do not overcook.",
            "To Make Frosting:  Combine 3 tablespoons softened butter, 3 tablespoons cocoa, honey, 1 teaspoon vanilla extract, and 1 cup confectioners' sugar. Stir until smooth. Frost brownies while they are still warm."
        ]
    },
    {
        "title": "Chicken Pot Pie IX",
        "picture": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https://images.media-allrecipes.com/userphotos/3910164.jpg&w=800&q=85",
        "ingredients": [
            "1 pound skinless, boneless chicken breast halves - cubed",
            "1 cup sliced carrots",
            "1 cup frozen green peas",
            "½ cup sliced celery",
            "⅓ cup butter",
            "⅓ cup chopped onion",
            "⅓ cup all-purpose flour",
            "½ teaspoon salt",
            "¼ teaspoon black pepper",
            "¼ teaspoon celery seed",
            "1 ¾ cups chicken broth",
            "⅔ cup milk",
            "2 (9 inch)  unbaked pie crusts"
        ],
        "method": [
            "Preheat oven to 425 degrees F (220 degrees C.)",
            "In a saucepan, combine chicken, carrots, peas, and celery. Add water to cover and boil for 15 minutes. Remove from heat, drain and set aside.",
            "In the saucepan over medium heat, cook onions in butter until soft and translucent. Stir in flour, salt, pepper, and celery seed. Slowly stir in chicken broth and milk. Simmer over medium-low heat until thick. Remove from heat and set aside.",
            "Place the chicken mixture in bottom pie crust. Pour hot liquid mixture over. Cover with top crust, seal edges, and cut away excess dough. Make several small slits in the top to allow steam to escape.",
            "Bake in the preheated oven for 30 to 35 minutes, or until pastry is golden brown and filling is bubbly. Cool for 10 minutes before serving."
        ]
    }
]